In [66]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [67]:
df=pd.read_csv('cars.csv')
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [68]:
df['fuel'].unique()

array(['Diesel', 'Petrol', 'LPG', 'CNG'], dtype=object)

In [69]:
df['owner'].unique()

array(['First Owner', 'Second Owner', 'Third Owner',
       'Fourth & Above Owner', 'Test Drive Car'], dtype=object)

In [70]:
df.columns

Index(['brand', 'km_driven', 'fuel', 'owner', 'selling_price'], dtype='object')

In [71]:
df.isnull().sum()

brand            0
km_driven        0
fuel             0
owner            0
selling_price    0
dtype: int64

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   brand          8128 non-null   object
 1   km_driven      8128 non-null   int64
 2   fuel           8128 non-null   object
 3   owner          8128 non-null   object
 4   selling_price  8128 non-null   int64
dtypes: int64(2), object(3)
memory usage: 317.6+ KB

In [73]:
df.describe()

          km_driven  selling_price
count  8.128000e+03   8.128000e+03
mean   6.981951e+04   6.382718e+05
std    5.655055e+04   8.062534e+05
min    1.000000e+00   2.999900e+04
25%    3.500000e+04   2.549990e+05
50%    6.000000e+04   4.500000e+05
75%    9.800000e+04   6.750000e+05
max    2.360457e+06   1.000000e+07

# To do One hot encoding using the pandas

In [74]:
pd.get_dummies(df,columns=['fuel', 'owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,False,True,False,False,True,False,False,False,False
1,Skoda,120000,370000,False,True,False,False,False,False,True,False,False
2,Honda,140000,158000,False,False,False,True,False,False,False,False,True
3,Hyundai,127000,225000,False,True,False,False,True,False,False,False,False
4,Maruti,120000,130000,False,False,False,True,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,False,True,True,False,False,False,False
8124,Hyundai,119000,135000,False,True,False,False,False,True,False,False,False
8125,Maruti,120000,382000,False,True,False,False,True,False,False,False,False
8126,Tata,25000,290000,False,True,False,False,True,False,False,False,False
8127,Tata,25000,290000,False,True,False,False,True,False,False,False,False

In [75]:
pd.get_dummies(df,columns=['fuel', 'owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,True,False,False,False,False,False,False
1,Skoda,120000,370000,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,False
4,Maruti,120000,130000,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,True,False,False,False,False
8124,Hyundai,119000,135000,True,False,False,True,False,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,False

# To do One hot encoding using the sklearn

In [76]:
y=df['selling_price']
y

0       450000
1       370000
2       158000
3       225000
4       130000
         ...
8123    320000
8124    135000
8125    382000
8126    290000
8127    290000
Name: selling_price, Length: 8128, dtype: int64

In [77]:
x=df.drop(columns=['selling_price'])
x

        brand  km_driven    fuel                 owner
0      Maruti     145500  Diesel           First Owner
1       Skoda     120000  Diesel          Second Owner
2       Honda     140000  Petrol           Third Owner
3     Hyundai     127000  Diesel           First Owner
4      Maruti     120000  Petrol           First Owner
...       ...        ...     ...                   ...
8123  Hyundai     110000  Petrol           First Owner
8124  Hyundai     119000  Diesel  Fourth & Above Owner
8125   Maruti     120000  Diesel           First Owner
8126     Tata      25000  Diesel           First Owner
8127     Tata      25000  Diesel           First Owner

[8128 rows x 4 columns]

In [78]:
# before that do test_train_split
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3)

In [79]:
x_train.shape,x_test.shape

((5689, 4), (2439, 4))

In [80]:
x_train.head()

        brand  km_driven    fuel        owner
5360  Hyundai      25000  Diesel  First Owner
7013     Tata     158000  Diesel  First Owner
4700  Renault      90000  Diesel  First Owner
6864   Datsun       7000  Petrol  First Owner
196   Hyundai       5000  Petrol  First Owner

In [81]:
x_test.head()

        brand  km_driven    fuel         owner
1624     Tata      80000  Diesel   First Owner
2506  Hyundai      70000  Diesel  Second Owner
4230      BMW       8500  Diesel   First Owner
2722      BMW      60000  Diesel  Second Owner
3402     Tata      70000  Petrol   First Owner

In [85]:
from sklearn.preprocessing import OneHotEncoder
# obj of onehotencoder

ohe=OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)
# spare['false]
# here we need to do onehotencoding only on colums['fuel],['owner] and after endoing we need to merge them all,which id difficult and problematic so we will do column tranformers

In [87]:

# df_encoded=ohe.fit_transform(df[['fuel', 'owner']]).toarray()
x_train_encoded=ohe.fit_transform(x_train[['fuel', 'owner']])
x_train_encoded
# by default sparse matrix is coming .so we need to convert it into np.array or we can write spare['false']

array([[1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 1]])

In [88]:
x_test_encoded=ohe.transform(x_test[['fuel', 'owner']])
x_test_encoded

array([[1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       ...,
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 1],
       [0, 0, 1, ..., 0, 0, 0]])

In [89]:
x_train.shape,x_test.shape

((5689, 4), (2439, 4))

In [90]:
x_train_encoded.shape,x_test_encoded.shape

((5689, 7), (2439, 7))

### to merge all the column that x_train_encoded,x_test_encoded,brands,km_driven

In [91]:
np.hstack((x_train[['brand','km_driven']].values,x_train_encoded))

array([['Hyundai', 25000, 1, ..., 0, 0, 0],
       ['Tata', 158000, 1, ..., 0, 0, 0],
       ['Renault', 90000, 1, ..., 0, 0, 0],
       ...,
       ['Toyota', 68089, 0, ..., 0, 0, 0],
       ['Maruti', 25000, 1, ..., 0, 0, 0],
       ['Hyundai', 70000, 0, ..., 0, 0, 1]], dtype=object)

### OneHotEncoding with Top Categories for brand

In [94]:
counts=df['brand'].value_counts()

In [95]:
df['brand'].nunique()

32

In [96]:
df['brand'].unique()

array(['Maruti', 'Skoda', 'Honda', 'Hyundai', 'Toyota', 'Ford', 'Renault',
       'Mahindra', 'Tata', 'Chevrolet', 'Fiat', 'Datsun', 'Jeep',
       'Mercedes-Benz', 'Mitsubishi', 'Audi', 'Volkswagen', 'BMW',
       'Nissan', 'Lexus', 'Jaguar', 'Land', 'MG', 'Volvo', 'Daewoo',
       'Kia', 'Force', 'Ambassador', 'Ashok', 'Isuzu', 'Opel', 'Peugeot'],
      dtype=object)

In [97]:
threshold=100

In [100]:
repl = counts[counts <= threshold].index
# values less than  100(threshold) ko replace kro uncommon se

In [99]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
5834,False,False,False,False,False,True,False,False,False,False,False,False,False
1244,False,False,False,False,False,False,True,False,False,False,False,False,False
458,False,False,False,False,False,False,False,False,False,False,False,False,True
4244,False,False,False,False,False,False,True,False,False,False,False,False,False
6651,False,False,False,False,True,False,False,False,False,False,False,False,False